---
kind: type
id: T:Autodesk.Revit.DB.ReferenceArrayArrayIterator
source: html/cc8a1335-48c7-fcc0-2033-054120832c7f.htm
---
# Autodesk.Revit.DB.ReferenceArrayArrayIterator

An iterator to a ReferenceArray array.

## Syntax (C#)
```csharp
public abstract class ReferenceArrayArrayIterator : APIObject,
	IEnumerator
```